---
kind: enumMember
id: F:Autodesk.Revit.DB.LightingSource.ExteriorArtificial
enum: Autodesk.Revit.DB.LightingSource
source: html/fdac3194-8087-233a-0383-878f4716aea1.htm
---
# Autodesk.Revit.DB.LightingSource.ExteriorArtificial

Exterior source of light, artificial light only.